     Hbnddir('BNDDIR')
     FMASTERL1  If   E             DISK
     C                   READ      MASTERL1                               99
     c                   callb     'XMOD25'
     C                   MOVE      '1'           *INLR
