CMD PROMPT('DUPLICATE SOURCE MEMBER SAMPLE')

    PARM KWD(FROMLIB) TYPE(*NAME) MIN(1) +
         PROMPT('FROM LIBRARY')

    PARM KWD(TOLIB) TYPE(*NAME) MIN(1) +
         PROMPT('TO LIBRARY')

    PARM KWD(LANG) TYPE(*CHAR) LEN(3) MIN(1) +
         PROMPT('LANGUAGE')

    PARM KWD(MBR) TYPE(*GENERIC) MIN(1) +
         PROMPT('MEMBER')

    PARM KWD(MBROPT) TYPE(*CHAR) LEN(8) MIN(0) +
         DFT(*ADD) RSTD(*YES) VALUES(*ADD *REPLACE) +
         PROMPT('MEMBER OPTION')
